[{"event_date":"2024-01-27T08:00:00.000Z","year":2024,"event_type":"Riots","mood":"Violent","district":"Mitte","source":"Berliner Zeitung","categories":"International politics","description":"On 27 January 2024, around 2,500 people took part in a demonstration near Neptunbrunnen in Berlin - Mitte (Berlin) in solidarity with Palestine. A counter-demonstration in solidarity with Israel of around 200 people took place around Marx-Engels-Forums. Clashes between both groups of demonstrators and the police occurred at the end of the demonstration.","crowd_size":"1000-10,000","longitude":13.4024,"latitude":52.5177},{"event_date":"2024-01-26T08:00:00.000Z","year":2024,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Berliner Zeitung","categories":"Agriculture","description":"On 26 January 2024, around 300 farmers staged a protest with their tractors in front of the party headquarter Berlin - Mitte (Berlin), advocating against the policies of the German federal government, expressing grievances related to their livelihoods and dissatisfaction with current conditions.","crowd_size":"200-500","longitude":13.4024,"latitude":52.5177},{"event_date":"2024-01-24T08:00:00.000Z","year":2024,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"La Capital Argentina","categories":"Human Rights","description":"On 24 January 2024, more than 150 people, including members of the Argentinian Socialist Workers' Party, gathered in front of the Argentine Embassy in Berlin - Mitte (Berlin) against the current Argentinian administration and in support of the strike of the Argentinian workers' federations against the government's economic measures. They also opposed new regulations criminalizing social protest and limiting freedom of expression, which they considered a danger to democracy, as well as the so-called omnibus law.","crowd_size":"100-200","longitude":13.4024,"latitude":52.5177},{"event_date":"2024-01-21T08:00:00.000Z","year":2024,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Bayerischer Rundfunk","categories":"Environment","description":"On 21 January 2024, around 1,000 farmers and climate activists staged a protest near the Brandenburg Gate in Berlin - Mitte (Berlin), advocating for an immediate energy turnaround and expressing dissatisfaction with current conditions.","crowd_size":"500-1000","longitude":13.4024,"latitude":52.5177},{"event_date":"2024-01-21T08:00:00.000Z","year":2024,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Dresdner Neueste Nachrichten","categories":"National politics","description":"On 21 January 2024, around 100,000 people staged a protest in Berlin - Mitte (Berlin), advocating against the AfD. The protest was prompted by concerns over a secret meeting between AfD representatives, discussing mass deportations of individuals with German citizenship and migrant background, leading to a heightened awareness and mobilization against right-wing ideologies in various cities.","crowd_size":">10,000","longitude":13.4024,"latitude":52.5177},{"event_date":"2024-01-20T08:00:00.000Z","year":2024,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Berliner Morgenpost","categories":"National politics","description":"On 20 January 2024, around 8,000 farmers staged a protest near the chancellery in Berlin - Mitte (Berlin), advocating against the policies of the German federal government, expressing grievances related to their livelihoods and dissatisfaction with current conditions.","crowd_size":"1000-10,000","longitude":13.4024,"latitude":52.5177},{"event_date":"2024-01-20T08:00:00.000Z","year":2024,"event_type":"Protests","mood":"Peaceful","district":"Neukolln","source":"Merkur","categories":"International politics","description":"On 20 January 2024, around 1,000 people staged a pro-Palestine protest in Berlin - Neukolln (Berlin), aiming to express solidarity with Palestine.","crowd_size":"500-1000","longitude":13.4354,"latitude":52.481},{"event_date":"2024-01-19T08:00:00.000Z","year":2024,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Berliner Zeitung","categories":"National politics","description":"On 19 January 2024, around 1,250 truck drivers, freight contractors, craftsmen, and farmers staged a protest near the Berlin Victory Column in Berlin - Mitte (Berlin), advocating against the policies of the German federal government, expressing grievances related to their livelihoods and dissatisfaction with current conditions.","crowd_size":"1000-10,000","longitude":13.4024,"latitude":52.5177},{"event_date":"2024-01-18T08:00:00.000Z","year":2024,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Morgen Post","categories":"Agriculture","description":"On 18 January 2024, around 350 farmers staged a protest in front of the Brandenburg Gate in Berlin - Mitte (Berlin). The event was part of a nationwide demonstration movement called by farmers to denounce the government's plan to cut agricultural sector subsidies.","crowd_size":"200-500","longitude":13.4024,"latitude":52.5177},{"event_date":"2024-01-18T08:00:00.000Z","year":2024,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Der Tagesspiegel","categories":"National politics","description":"On 18 January 2024, around 100 healthcare workers from the Jewish Hospital in Berlin staged a protest outside the Berlin Parliament in Berlin - Mitte (Berlin), demanding a collective bargaining agreement that includes provisions for relief shifts or measures to address workload and stress issues.","crowd_size":"50-100","longitude":13.4024,"latitude":52.5177},{"event_date":"2024-01-17T08:00:00.000Z","year":2024,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Der Tagesspiegel","categories":"National politics","description":"On 17 January 2024, up to 3,500 people staged a protest in front of the Red City Hall in Berlin - Mitte (Berlin), advocating against the Alternative for Germany (AfD). The protest was prompted by concerns over a secret meeting of AfD representatives and far-right activists, to discuss mass deportations of individuals with German citizenship and a migrant background, leading to a heightened awareness and mobilization against right-wing ideologies in various cities.","crowd_size":"1000-10,000","longitude":13.4024,"latitude":52.5177},{"event_date":"2024-01-16T08:00:00.000Z","year":2024,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Berliner Zeitung","categories":"Agriculture","description":"On 16 January 2024, several hundred people with about 330 vehicles held a vigil in front of Brandenburger Tor in Berlin - Mitte (Berlin) throughout the day called for by the association 'Free Farmers' (Freie Bauern). The event was part of a nationwide farmers' demonstration movement against planned agricultural subsidy cuts.","crowd_size":"200-500","longitude":13.4024,"latitude":52.5177},{"event_date":"2024-01-14T08:00:00.000Z","year":2024,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Berliner Morgenpost","categories":"National politics","description":"On 14 January 2024, 25,000 people, including human rights activists, Left Party Federal Chair Janine Wissler, participated in a protest in Berlin - Mitte (Berlin) called for by 'Joint General Association' (Paritatischer Gesamtverband), Fridays for Future, and numerous other organizations, and supported by Jusos, GJ, Grannies Against the Right, Extinction Rebellion and the association 'Hawwar help' (an association that stands up for a self-determined life in safety for everyone) under the motto 'Defend democracy, stick together' against the shift to the right in Germany and the AfD. The protest occurred in the context of recent reports of a secret meeting between AfD members and right-wing extremists in Potsdam past November.","crowd_size":">10,000","longitude":13.4024,"latitude":52.5177},{"event_date":"2024-01-12T08:00:00.000Z","year":2024,"event_type":"Protests","mood":"Peaceful","district":"Tempelhof-Schoneberg","source":"Der Tagesspiegel","categories":"Agriculture","description":"On 12 January 2024, farmers gathered with their vehicles, blocking a highway between the Teltow/BER exit and Nahmitzer Damm in Berlin - Tempelhof-Schoneberg (Berlin). The event was part of a nationwide farmers' demonstration movement against planned agricultural subsidy cuts.","crowd_size":"no report","longitude":13.3738,"latitude":52.4406},{"event_date":"2024-01-12T08:00:00.000Z","year":2024,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Der Tagesspiegel","categories":"International politics","description":"On 12 January 2024, several hundred protesters gathered at the Central Station in Berlin - Mitte, demanding an urgent ceasefire in Gaza. The protesters shouted pro-Palestinian chants.","crowd_size":"200-500","longitude":13.4024,"latitude":52.5177},{"event_date":"2024-01-12T08:00:00.000Z","year":2024,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Der Tagesspiegel","categories":"National politics","description":"On 12 January 2024, 350 people, including FFF and The Greens representatives, protested against fascism, racism, and social exclusion in Berlin - Mitte, voicing their dissatisfaction with the plan proposed by the right-wing forces in the country, which implies expelling the population with migrant backgrounds. The protesters also called for banning the AFD political party.","crowd_size":"1000-10,000","longitude":13.4024,"latitude":52.5177},{"event_date":"2024-01-10T08:00:00.000Z","year":2024,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Berliner Morgenpost","categories":"Agriculture","description":"On 10 January 2024, overnight, 25 people with 24 tractors, 14 trucks and 4 cars, staged a vigil in front of Brandenburger Tor in Berlin - Mitte (Berlin). The event was part of a nationwide farmers' demonstration movement against planned agricultural subsidy cuts.","crowd_size":"0-50","longitude":13.4024,"latitude":52.5177},{"event_date":"2024-01-10T08:00:00.000Z","year":2024,"event_type":"Protests","mood":"With intervention","district":"Tempelhof-Schoneberg","source":"Berliner Zeitung","categories":"Agriculture","description":"On 10 January 2024, 16 Last Generation activists protested at Innsbrucker Platz in Berlin - Tempelhof-Schoneberg (Berlin) to raise awareness about the climate crisis and to denounce 'double standards' in the coverage of their protests and their climate demands, and those of the farmers, many of whom were protesting against planned cuts to agricultural subsidies at the time of reporting. The police intervened and carried the protesters off the street.","crowd_size":"0-50","longitude":13.3738,"latitude":52.4406},{"event_date":"2024-01-08T08:00:00.000Z","year":2024,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Abendzeitung Munchen","categories":"Agriculture","description":"On 8 January 2024, approximately 550 farmers, including numerous tractors, staged a protest at the Brandenburg Gate in Berlin - Mitte (Berlin), as part of a nationwide farmers' demonstration movement against the German government's agricultural policies, notably its plans to introduce budget cuts to Agrardiesel and remove vehicle tax exemptions. Far-right and Querdenken activists joined the protest, with some showing handwritten banners reading 'The Democrats bring the death of the people'.","crowd_size":"500-1000","longitude":13.4024,"latitude":52.5177},{"event_date":"2024-01-07T08:00:00.000Z","year":2024,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Berliner Morgenpost","categories":"Agriculture","description":"On 7 January 2024, around 48 farmers staged a protest with their tractors along the 17 of June Street in Berlin - Mitte (Berlin), as part of a nationwide farmers' demonstration movement against the German government's agricultural policies, protesting against the planned budget cuts concerning Agrardiesel and vehicle tax exemptions.","crowd_size":"0-50","longitude":13.4024,"latitude":52.5177},{"event_date":"2024-01-07T08:00:00.000Z","year":2024,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Mitteldeutschen Zeitung","categories":"Environment","description":"On 7 January 2024, around a dozen Last Generation activists staged a protest in front of the Brandenburg Gate in Berlin - Mitte (Berlin), referencing ongoing heavy rainfall in Germany with slogans like 'Climate protection is the best monument protection' and 'Floods know no monument protection'; the activists also stacked sandbags in front of the Brandenburg Gate.","crowd_size":"0-50","longitude":13.4024,"latitude":52.5177},{"event_date":"2024-01-07T08:00:00.000Z","year":2024,"event_type":"Protests","mood":"Peaceful","district":"Neukolln","source":"Die Tageszeitung","categories":"International politics","description":"On 7 January 2024, approximately 700 individuals staged a protest in Berlin - Neukolln (Berlin), taking part in a car procession consisting of around 230 cars, protesting against the Israeli military campaign in Gaza and expressing solidarity with Palestine under the slogan 'Palestine will be Free.'","crowd_size":"500-1000","longitude":13.4354,"latitude":52.481},{"event_date":"2023-12-31T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Indymedia","categories":"Human Rights","description":"On 31 December 2023, about 300 people participated in a protest in front of the prison in Moabit in Berlin - Mitte (Berlin) in solidarity with the prisoners, for the abolishment of prisons and against the repressions of defendants.","crowd_size":"200-500","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-12-31T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Neukolln","source":"Oe24","categories":"International politics","description":"On 31 December 2023, about 2,000 people participated in a pro-Palestine protest in Berlin - Neukolln (Berlin) under the motto 'No New Year's Eve - Solidarity with Palestine'.","crowd_size":"1000-10,000","longitude":13.4354,"latitude":52.481},{"event_date":"2023-12-31T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Reinickendorf","source":"Indymedia","categories":"National politics","description":"On 31 December 2023, about 60 people participated in a protest in front of the prison in Tegel in Berlin - Reinickendorf (Berlin) in solidarity with the prisoners and for the abolishment of prisons as well as against the repressions of defendants.","crowd_size":"50-100","longitude":13.3459,"latitude":52.5711},{"event_date":"2023-12-30T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Charlottenburg-Wilmersdorf","source":"Merkur","categories":"International politics","description":"On 30 December 2023, about 500 people participated in a pro-Palestine protest in Berlin - Charlottenburg-Wilmersdorf (Berlin) under the motto 'Solidarity with Palestine'.","crowd_size":"200-500","longitude":13.2639,"latitude":52.5079},{"event_date":"2023-12-29T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Indymedia","categories":"International politics","description":"On 29 December 2023, up to 100 people, including Israeli immigrants, participated in a protest in Berlin - Mitte (Berlin) close to the foreign ministry called for by the newly found network 'Israelis fur den Frieden' (Israelis for Peace) against the war in Gaza and what they claim to be a genocide, as well as for an immediate ceasefire, for a diplomatic solution and for the exchange of all hostages. The participants were also against German arms deliveries to Israel, against Netanyahu's right-wing government and the illegal occupation and settlement policy.","crowd_size":"50-100","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-12-23T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Friedrichshain-Kreuzberg","source":"Der Tagesspiegel","categories":"International politics","description":"On 23 December 2023, around 2,000 people protested in Berlin - Friedrichshain-Kreuzberg (Berlin), demonstrating solidarity with Palestine, condemning the bombing of Gaza, and advocating for an end to the conflict in the Middle East, marching from Hallesches Tor in Kreuzberg to the Brandenburg Gate.","crowd_size":"1000-10,000","longitude":13.4403,"latitude":52.501},{"event_date":"2023-12-20T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Charlottenburg-Wilmersdorf","source":"Berliner Morgenpost","categories":"International politics","description":"On 20 December 2023, around 100 individuals, including Palestinian, Jewish, and allied students, staged a protest at the University of the Arts in Berlin - Charlottenburg-Wilmersdorf (Berlin), criticizing the universities' handling of the Gaza conflict, demanding solidarity and advocating for Palestinian rights while condemning what they perceive as biased narratives and censorship by universities regarding the conflict in the Gaza Strip.","crowd_size":"50-100","longitude":13.2639,"latitude":52.5079},{"event_date":"2023-12-20T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Tempelhof-Schoneberg","source":"Die Tageszeitung","categories":"National politics","description":"On 20 December 2023, tenants' representatives from Berlin's municipal housing companies staged a protest in Berlin in Bulowstreet-Ost (Berlin - Tempelhof-Schoneberg, Berlin), protesting against rent increases following the termination of social commitments, emphasizing the impact on tenants due to heightened rents.","crowd_size":"no report","longitude":13.3738,"latitude":52.4406},{"event_date":"2023-12-19T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Berliner Zeitung","categories":"International politics","description":"On 19 December 2023, about 300 activists gathered for a pro-Palestine rally at the main train station in Berlin - Mitte (Berlin), condemning the Israeli occupation.","crowd_size":"200-500","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-12-18T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Norddeutscher Rundfunk","categories":"Agriculture","description":"On 18 December 2023, 8-10 thousand farmers gathered for a rally in Berlin - Mitte (Berlin), protesting against the proposed reduction of tax bonuses for agricultural fuel. Associations of farmers organized gatherings and rides also at numerous other locations across the country.","crowd_size":"1000-10,000","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-12-17T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Neukolln","source":"Der Tagesspiegel","categories":"International politics","description":"On 17 December 2023, about 750 activists in 500 cars demonstratively rode through Berlin - Neukolln (Berlin), demanding freedom for Palestine.","crowd_size":"500-1000","longitude":13.4354,"latitude":52.481},{"event_date":"2023-12-16T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Berliner Zeitung","categories":"Environment","description":"On 16 December 2023, activists gathered for a rally in Berlin - Mitte (Berlin), demanding immediate climate action.","crowd_size":"no report","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-12-15T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Neukolln","source":"Die Tageszeitung","categories":"","description":"On 15 December 2023, about 50 parents and students gathered near their school in Berlin - Neukolln (Berlin), demanding better conditions for studies and learning, especially more teachers.","crowd_size":"0-50","longitude":13.4354,"latitude":52.481},{"event_date":"2023-12-15T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Charlottenburg-Wilmersdorf","source":"Berliner Zeitung","categories":"International politics","description":"On 15 December 2023, about 300 activists gathered for a pro-Palestine march from Wittenberg Square to Olivaer Square in Berlin - Charlottenburg-Wilmersdorf (Berlin), decrying the violence perpetrated by Israel on Palestinian civilians.","crowd_size":"200-500","longitude":13.2639,"latitude":52.5079},{"event_date":"2023-12-15T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Indymedia","categories":"Human Rights","description":"On 15 December 2023, leftist and anti-fascist activists gathered for a rally at an unspecified location in Berlin (Berlin), demanding immediate release of one of their fellows, currently facing trial in detention for their political activities.","crowd_size":"no report","longitude":13.4105,"latitude":52.5244},{"event_date":"2023-12-14T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"With intervention","district":"Steglitz-Zehlendorf","source":"Der Tagesspiegel","categories":"International politics","description":"On 14 December 2023, between 50 and 60 students and activists from 'Students for Free Palestine' occupied a lecture hall at Free University in Berlin - Steglitz-Zehlendorf (Berlin) and prevented Jewish students from entering. Police officers were present and verified the protesters' identities. During the occupation, there were also physical confrontations between pro-Palestinian activists and university students who tried to stop the occupation by tearing down flyers and posters. A police spokesman said several reports of assault had been made. Two demonstrators were slightly injured and complained of pain.","crowd_size":"50-100","longitude":13.2317,"latitude":52.428},{"event_date":"2023-12-10T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Berliner Morgenpost","categories":"International politics","description":"On 10 December 2023, around 2,500 people demonstrated along Friedrichstrasse in Berlin - Mitte (Berlin) in solidarity with Palestine and to call for an end to arms deliveries to Israel, accusing the country of engaging in a 'genocide'. Members of BDS were present to call for the boycott of the State of Israel and Israeli products because of its actions against Palestinians.","crowd_size":"1000-10,000","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-12-10T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Berliner Zeitung","categories":"International politics","description":"On 10 December 2023, between 3,000 (according to the police) and 11,000 (according to organizers) people, including the mayor of Berlin (CDU), Federal Labor Minister (SPD), officials of The Greens, the Bundestag President (SPD), and a Rabbi, demonstrated from Victory Column to the Brandenburg Gate in Berlin - Mitte (Berlin) against anti-Semitism, hatred, racism, and xenophobia. Protesters called for solidarity and respectful coexistence, as well as a de-correlation between anti-Semitism and anti-Israel sentiments amid the 2023 Israel-Hamas War. They gathered under the motto 'Never again is now, Germany stands up'.","crowd_size":"1000-10,000","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-12-09T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"With intervention","district":"Friedrichshain-Kreuzberg","source":"Berliner Morgenpost","categories":"Environment","description":"On 9 December 2023, at the call of XR, Last Generation, and Scientist Rebellion, between 150 (according to the police) and 400 (according to organizers) people blocked traffic on the Elsenbrucke (Elsen bridge) in Berlin - Friedrichshain-Kreuzberg (Berlin) against the fossil fuel industry and the expansion of the city highway A100. Police officers intervened to remove some activists who had glued themselves to the road.","crowd_size":"200-500","longitude":13.4403,"latitude":52.501},{"event_date":"2023-12-09T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Treptow-Kopenick","source":"Hannoversche Allgemeine","categories":"Economy","description":"On 9 December 2023, Borussia Monchengladbach football club supporters staged a protest by displaying placards and banners inside Union Berlin football club's Stadium An der Alten Forsterei in Berlin - Treptow-Kopenick (Berlin) against an investor of the German Football League (DFL).","crowd_size":"no report","longitude":13.6006,"latitude":52.4175},{"event_date":"2023-12-08T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Charlottenburg-Wilmersdorf","source":"Berliner Zeitung","categories":"International politics","description":"On 8 December 2023, at the call of FFI (Fridays for Israel), around 80 people, including members of JU, CDU, an MP (The Greens), DIG, the Jewish community, and students, gathered at the UDK - Universitat der Kunste (University of the Arts) on Hardenbergstrasse in Berlin - Charlottenburg-Wilmersdorf (Berlin) in support of Israel and against anti-Semitism at universities. Protesters chanted 'Free Gaza from Hamas.'","crowd_size":"50-100","longitude":13.2639,"latitude":52.5079},{"event_date":"2023-12-06T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Reinickendorf","source":"Berliner Morgenpost","categories":"National politics","description":"On 6 December 2023, almost 50 people, including members of Grannies Against the Right, the Left, SPD, The Greens, and DGB, demonstrated in front of the Maestral restaurant opposite the Reinickendorf town hall in Berlin - Reinickendorf (Berlin) against the far-right political party AFD, which they denounced as 'a fascist, racist, xenophobic and anti-constitutional party whose aim is to destabilize the basic democratic order and divide society.'","crowd_size":"0-50","longitude":13.3459,"latitude":52.5711},{"event_date":"2023-12-06T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Charlottenburg-Wilmersdorf","source":"Berliner Morgenpost","categories":"Economy","description":"On 6 December 2023, in the morning, at the call of Ver.di, GEW, and the police union GDP - Gewerkschaft der Polizei, around 13,000 striking employees gathered at Ernst-Reuter Square and marched toward Kurfurstendamm in Berlin - Charlottenburg-Wilmersdorf (Berlin) to protest for better pay. They had gathered while a conference of German labor and social ministers was taking place in the city.","crowd_size":">10,000","longitude":13.2639,"latitude":52.5079},{"event_date":"2023-12-05T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Mite","source":"Presseportal","categories":"Economy","description":"On 5 December 2023, people, including members of the humanitarian and development organization 'Action Against Hunger', with the support of WeAct (Campact's petition platform), protested in Berlin (Berlin) and handed over a petition signed by 77,000 people as part of the campaign 'Nestle: Stop your advertising for baby milk' to call on Nestle to adhere to the guidelines of the WHO and stop advertising for powdered baby milk.","crowd_size":"no report","longitude":13.4105,"latitude":52.5244},{"event_date":"2023-12-05T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Pankow","source":"Berliner Zeitung","categories":"Environment","description":"On 5 December 2023, Last Generation activists protested at Schonhauser Allee, standing in front of the Schonhauser Arcaden, in Berlin - Pankow (Berlin), demanding more climate action.","crowd_size":"no report","longitude":13.4031,"latitude":52.566},{"event_date":"2023-12-03T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Berliner Zeitung","categories":"Environment","description":"On 3 December 2023, XR activists protested in Berlin (Berlin), demonstrating in several subways dressed as flight attendants, against the United Nations Climate Change Conference (COP28) simultaneously taking place in Dubai, which they consider a greenwashing event by politicians and lobbyists.","crowd_size":"no report","longitude":13.4105,"latitude":52.5244},{"event_date":"2023-12-02T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Der Tagesspiegel","categories":"International politics","description":"On 2 December 2023, people participated in a vigil on Brunnenstrasse in Berlin - Mitte (Berlin) to condemn anti-Semitism amid the 2023 Israel-Hamas War.","crowd_size":"no report","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-12-02T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"With intervention","district":"Mitte","source":"Der Tagesspiegel","categories":"International politics","description":"On 2 December 2023, about 2,000 people participated in a pro-Palestine protest in Berlin - Mitte (Berlin) under the motto 'Stop the genocide in Gaza'. The police arrested some of the participants.","crowd_size":"1000-10,000","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-12-02T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Tempelhof-Schoneberg","source":"Berliner Morgenpost","categories":"Housing","description":"On 2 December 2023, about 80 tenants of 'Deutsche Wohnen' in Britzer Strasse protested in Mariendorf in Berlin - Tempelhof-Schoneberg (Berlin) against what they called 'unacceptable' living conditions.","crowd_size":"50-100","longitude":13.3738,"latitude":52.4406},{"event_date":"2023-12-02T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Friedrichshain-Kreuzberg","source":"Der Tagesspiegel","categories":"International politics","description":"On 2 December 2023, around 430 people participated in a pro-Palestine protest in Berlin - Friedrichshain-Kreuzberg (Berlin) under the motto 'Solidarity with Palestine' amid the 2023 Israel-Hamas War.","crowd_size":"200-500","longitude":13.4403,"latitude":52.501},{"event_date":"2023-12-01T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"With intervention","district":"Friedrichshain-Kreuzberg","source":"Berliner Zeitung","categories":"Environment","description":"On 1 December 2023, 6 Last Generation activists, including some working in craft-related professions, protested in Berlin - Friedrichshain-Kreuzberg (Berlin) by gluing themselves onto and blocking Blucherstrasse close to the Chamber of Crafts to raise awareness about the consequences of the climate crisis on trade, industry and agriculture. The police intervened to detach and remove the activists from the road.","crowd_size":"0-50","longitude":13.4403,"latitude":52.501},{"event_date":"2023-12-01T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Der Tagesspiegel","categories":"Environment","description":"On 1 December 2023, Scientist Rebellion activists protested in Berlin - Mitte (Berlin) for an end to climate-damaging subsidies and the fossil-fuel era, and called on the German government to implement concrete actions to tackle climate change. They had gathered on the occasion of the UN Climate Change Conference COP28, which was simultaneously taking place in Dubai.","crowd_size":"no report","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-11-30T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Berliner Zeitung","categories":"","description":"On 30 November 2023, about 70 people participated in a protest in Berlin - Mitte (Berlin) called for by Ver.di to raise awareness for staff shortage and the increased workload in daycare centers.","crowd_size":"50-100","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-11-29T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Friedrichshain-Kreuzberg","source":"Berliner Zeitung","categories":"International politics","description":"On 29 November 2023, people participated in a protest under the motto 'Solidarity for Palestine' in Berlin - Friedrichshain-Kreuzberg (Berlin).","crowd_size":"no report","longitude":13.4403,"latitude":52.501},{"event_date":"2023-11-29T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Berliner Zeitung","categories":"International politics","description":"On 29 November 2023, people participated in a protest under the motto 'Freedom and Peace for Palestine' at Mathilde-Jacob-Platz in Berlin - Mitte (Berlin).","crowd_size":"no report","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-11-29T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Charlottenburg-Wilmersdorf","source":"Die Tageszeitung","categories":"International politics","description":"On 29 November 2023, about 2 dozen students participated in a protest at Universitat der Kunste in Berlin - Charlottenburg-Wilmersdorf (Berlin) under the motto 'Strike for Palestine' in solidarity with Palestine.","crowd_size":"0-50","longitude":13.2639,"latitude":52.5079},{"event_date":"2023-11-29T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Friedrichshain-Kreuzberg","source":"Indymedia","categories":"Economy","description":"On 29 November 2023, about 200 people participated in an antimilitarist and anticapitalist protest in Berlin - Friedrichshain-Kreuzberg (Berlin) against the Berlin Security Conference and all wars.","crowd_size":"100-200","longitude":13.4403,"latitude":52.501},{"event_date":"2023-11-27T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Westdeutsche Allgemeine Zeitung","categories":"Environment","description":"On 27 November 2023, Greenpeace activists gathered in Berlin - Mitte for a rally, protesting against the ongoing summit of car industry stakeholders and companies taking place in the official residence of the Chancellor and calling for more efforts for climate-friendly policies.","crowd_size":"no report","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-11-27T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Suddeutsche Zeitung","categories":"Economy","description":"On 27 November 2023, teachers and other employees in the educational sector affiliated with GEW union gathered in Berlin, demanding higher wages and other social benefits.","crowd_size":"no report","longitude":13.4105,"latitude":52.5244},{"event_date":"2023-11-26T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Friedrichshain-Kreuzberg","source":"Die Tageszeitung","categories":"National politics","description":"On 26 November 2023, about 1,000 people gathered for a rally in Berlin - Friedrichshain-Kreuzberg, protesting against a proposed legal restriction of asylum requirements.","crowd_size":"500-1000","longitude":13.4403,"latitude":52.501},{"event_date":"2023-11-25T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Charlottenburg-Wilmersdorf","source":"Suddeutsche Zeitung","categories":"Environment","description":"On 25 November 2023, about 800 Last Generation activists gathered and blocked a street in Berlin - Charlottenburg-Wilmersdorf, demanding immediate climate action.","crowd_size":"500-1000","longitude":13.2639,"latitude":52.5079},{"event_date":"2023-11-25T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Der Tagesspiegel","categories":"International politics","description":"On 25 November 2023, about 3,200 people gathered for a pro-Palestinian rally in Berlin - Mitte.","crowd_size":"1000-10,000","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-11-25T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Treptow-Kopenick","source":"Berliner Zeitung","categories":"Environment","description":"On 25 November 2023, about 31 Last Generation activists gathered and blocked a street in Berlin - Treptow-Kopenick, demanding immediate climate action.","crowd_size":"0-50","longitude":13.6006,"latitude":52.4175},{"event_date":"2023-11-24T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Braunschweiger Zeitungsverlag","categories":"National politics","description":"On 24 November 2023, as part of a national day of strike called by IGM and IGBCE, about 2,000 industrial workers gathered for a rally near the Ministry of Finance in Berlin - Mitte (Berlin), demanding cheaper electricity tariffs in order to preserve local production and workplaces.","crowd_size":"1000-10,000","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-11-22T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Saarbruecker Zeitung","categories":"National politics","description":"On 22 November 2023, Ver.di labor union representatives of state employees, including teachers, police officers, firefighters, and administration officials, gathered for a march in Berlin - Mitte (Berlin), demanding higher salaries.","crowd_size":"no report","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-11-20T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Mitteldeutschen Zeitung","categories":"National politics","description":"On 20 November 2023, around 75 people protested in Berlin - Mitte (Berlin) on the occasion of International Children's Day, for the release of the children abducted by Hamas.","crowd_size":"1000-10,000","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-11-20T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Mitteldeutschen Zeitung","categories":"International politics","description":"On 20 November 2023, 1,400 people, including university employees, participated in a protest in front of the main building of Humboldt-University in Berlin - Mitte (Berlin) called for by Ver.di and GEW under the motto 'An end to precarious science' in the context of a nationwide university warning strike due to the ongoing collective bargaining for the public service of the federal states.","crowd_size":"1000-10,000","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-11-19T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Charlottenburg-Wilmersdorf","source":"Berliner Zeitung","categories":"International politics","description":"On 19 November 2023, 500 people, including members of the Jewish community, participated in a protest in Berlin - Charlottenburg-Wilmersdorf (Berlin) called for by the organization 'Judisches Leben Berlin (JLB)' (Jewish Life Berlin) against anti-Semitism and for solidarity with Israel.","crowd_size":"200-500","longitude":13.2639,"latitude":52.5079},{"event_date":"2023-11-18T08:00:00.000Z","year":2023,"event_type":"Riots","mood":"Violent","district":"Mitte","source":"Leipziger Volkszeitung","categories":"Human Rights","description":"On 18 November 2023, at the call of 'Verband der Kurdinnen in Deutschland (YJK-E)' (Association of Kurdish Women in Germany), between around 4,000 (according to police) and 6,000 people (according to the organizers), including members of the Kurdish and Turkish communities, marched from Oranienplatz in Berlin - Friedrichshain-Kreuzberg to Schlossplatz in Berlin - Mitte (Berlin) against the ban on the Kurdistan Workers' Party (PKK) and the politics of Turkiye's president Erdogan. One demonstrator hit a police officer with a flagpole and was arrested. At the end of the demonstration, clashes occurred when police officers wanted to check the identity of a demonstrator who had previously shouted banned slogans. The organizing committee of the demonstration later criticized police violence during the demonstration.","crowd_size":"1000-10,000","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-11-18T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Berliner Zeitung","categories":"International politics","description":"On 18 November 2023, about 5,000 people, including many women, participated in a pro-Palestine protest starting on Friedrichstrasse and ending on Grosser Stern in Berlin - Mitte (Berlin) for solidarity with Palestine and respect for human rights and freedom of expression, and against hatred, anti-Semitism, Israel's actions in the Gaza strip and the German government's reluctance to call out what they claim to be Israel's war crimes.","crowd_size":"1000-10,000","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-11-17T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Berliner Zeitung","categories":"Environment","description":"On 17 November 2023, employees of five aid organizations, Arbeiter-Samariter-Bund (ASB), Deutsche Lebensrettungsgesellschaft (DLRG) (German Life Saving Association), Deutsches Rotes Kreuz (DRK) (German Red Cross), Johanniter and Malteser, protested in front of the House of Representatives in Berlin - Mitte (Berlin) against the underfunding of civil protection and disaster control.","crowd_size":"no report","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-11-17T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Mitteldeutschen Zeitung","categories":"International politics","description":"On 17 November 2023, around 120 people, including Federal Education Minister Bettina Stark-Watzinger (FDP), Jewish pianist Igor Levit, and Federal Green Party Leader Ricarda Lang, participated in a protest at the Humboldt-University in Berlin - Mitte (Berlin) called for by Fridays for Israel (FFI) for the safety of Jewish students, and to emphasize the right of existence of Israel and show solidarity with Jewish people.","crowd_size":"100-200","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-11-17T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Berliner Morgenpost","categories":"International politics","description":"On 17 November 2023, around 20 members of the 'Gesellschaft fur bedrohte Volker (GfbV)' (Society for Threatened Peoples) and the 'Syrian Kurdish Diaspora Network in Europe e.V.', protested near Schloss Bellevue in Berlin - Mitte (Berlin) under the motto 'No red carpet for the Islamist Erdogan' against the visit of Turkiye's president Erdogan to Germany. Shortly after, about 50 people participated in a protest in front of the chancellor's office in Berlin - Mitte (Berlin) for the same reasons.","crowd_size":"50-100","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-11-17T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Spandau","source":"Berliner Zeitung","categories":"Environment","description":"On 17 November 2023, 50 to 80 activists occupied the offices of district councilor Thorsten Schatz in Berlin - Spandau (Berlin) for about an hour and demanded a change to a decision made by the environmental and nature conservation department. The group entered the building and threatened one of the security guards with a pipe wrench.","crowd_size":"50-100","longitude":13.198,"latitude":52.5356},{"event_date":"2023-11-16T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Der Tagesspiegel","categories":"Economy","description":"On 16 November 2023, around 3,000 employees of the public services, including employees of daycare centers, social workers, and educators in youth, health, and social services offices, as well as members of AWO, participated in a protest in front of the House of Representatives in Berlin - Mitte (Berlin), called for by Ver.di and GEW against poor working conditions and for higher wages.","crowd_size":"1000-10,000","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-11-16T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Neukolln","source":"Suddeutsche Zeitung","categories":"International politics","description":"On 16 November 2023, around 600 people participated in a pro-Palestine protest starting at Oranienplatz in Berlin - Friedrichshain-Kreuzberg and ending in Berlin - Neukolln (Berlin) calling for a free Palestine.","crowd_size":"500-1000","longitude":13.4354,"latitude":52.481},{"event_date":"2023-11-13T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Charlottenburg-Wilmersdorf","source":"Die Tageszeitung","categories":"International politics","description":"On 13 November 2023, 80 to 100 students participated in a protest at Universitat der Kunste in Berlin - Charlottenburg-Wilmersdorf (Berlin) under the motto 'It's not complicated' in solidarity with Palestine and to draw attention to what they see as German politicians' complicity in the violence against Gaza.","crowd_size":"50-100","longitude":13.2639,"latitude":52.5079},{"event_date":"2023-11-11T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"With intervention","district":"Friedrichshain-Kreuzberg","source":"Markische Allgemeine","categories":"International politics","description":"On 11 November 2023, around 2,600 (according to the police) people gathered in Berlin - Friedrichshain-Kreuzberg (Berlin) for a pro-Palestine demonstration. They called for freedom for Palestine and spoke of genocide to define Israel's military operation in the Gaza Strip. Police officers temporarily arrested some demonstrators for carrying banners that they judged had 'criminal content'.","crowd_size":"1000-10,000","longitude":13.4403,"latitude":52.501},{"event_date":"2023-11-10T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Berliner Morgenpost","categories":"International politics","description":"On 10 November 2023, during the evening, at the call of Vereinigtes Palastinensisches Komittee (United Palestinian Committee), around 500 (according to the police) people gathered at the Checkpoint Charly and marched along Friedrichstrasse in Berlin - Mitte (Berlin) for a pro-Palestine demonstration under the motto 'Solidarity with Palestine'.","crowd_size":"200-500","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-11-10T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Steglitz-Zehlendorf","source":"Der Tagesspiegel","categories":"International politics","description":"On 10 November 2023, during the morning, at the call of JU, around 170 people, including MPs (CDU), Jewish students, and politicians, gathered in front of the main building of the Freien Universitat of Berlin (FU) in Berlin - Steglitz-Zehlendorf (Berlin) in solidarity with Israel, against anti-Semitism, and against pro-Palestine demonstrations. They promoted Israel's right to 'self-defense'. Protesters carried Israeli flags and Israeli rainbow flags.","crowd_size":"100-200","longitude":13.2317,"latitude":52.428},{"event_date":"2023-11-08T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Friedrichshain-Kreuzberg","source":"Berliner Morgenpost","categories":"International politics","description":"On 8 November 2023, around 250 people gathered in Berlin - Friedrichshain-Kreuzberg (Berlin) for a pro-Palestinian demonstration, consisting of a silent march with Palestinian flags.","crowd_size":"200-500","longitude":13.4403,"latitude":52.501},{"event_date":"2023-11-08T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Der Tagesspiegel","categories":"National politics","description":"On 8 November 2023, around 4,000 (according to organizers) people from several local welfare associations (including Caritas) and DGB members demonstrated in front of the Roten Rathaus in Berlin - Mitte (Berlin) to call on the government to provide more money for independent social institutions. They gathered amid budget negotiations in Berlin as well as at the federal level.","crowd_size":"1000-10,000","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-11-06T08:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Campact","categories":"Environment","description":"On 6 November 2023, Campact activists gathered for a rally in Berlin - Mitte (Berlin), near the office of the Chancellor, demanding the preservation of cheap public transport in order to mitigate climate change.","crowd_size":"no report","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-11-05T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Tempelhof-Schoneberg","source":"Der Tagesspiegel","categories":"International politics","description":"On 5 November 2023, about 450 people, including members of the local Jewish community, took part in a march in Berlin - Tempelhof-Schoneberg (Berlin), declaring their solidarity with Israel and condemning the 7 October 2023 attacks by Hamas.","crowd_size":"200-500","longitude":13.3738,"latitude":52.4406},{"event_date":"2023-11-04T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Suddeutsche Zeitung","categories":"International politics","description":"On 4 November 2023, at the call of several pro-Palestinian groups, about 6,000 people took to the streets of Berlin - Mitte (Berlin), expressing their support for Palestine and condemning the Israeli military campaign in and around the Gaza Strip.","crowd_size":"1000-10,000","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-11-03T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Steglitz-Zehlendorf","source":"Mitteldeutschen Zeitung","categories":"International politics","description":"On 3 November 2023, about 160 people, including students, participated in a pro-Palestine protest at the Freie Universitat in Berlin - Steglitz-Zehlendorf (Berlin) to demand an end of what they claim to be a genocide in Gaza, a ceasefire and an end to the war. Simultaneously, about 10 people held a counter-protest in solidarity with Israel.","crowd_size":"100-200","longitude":13.2317,"latitude":52.428},{"event_date":"2023-11-03T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Steglitz-Zehlendorf","source":"Berliner Zeitung","categories":"International politics","description":"On 3 November 2023, about 160 people gathered for a rally in Berlin - Steglitz-Zehlendorf (Berlin), near the Free University, expressing their support for Palestine and condemning the Israeli military campaign in and around the Gaza Strip. About a dozen counter-activists with Israeli flags gathered nearby, condemning the 7 October 2023 attack by Hamas, though no skirmishes were reported.","crowd_size":"100-200","longitude":13.2317,"latitude":52.428},{"event_date":"2023-11-03T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"With intervention","district":"Neukolln","source":"Judische Allgemeine","categories":"International politics","description":"On 3 November 2023, at the call of several pro-Palestinian organizations, about 9,000 people, including members of the leftist scene, took to the streets in Berlin - Neukolln (Berlin), expressing solidarity with Palestine and condemning the military campaign of Israel in and around Gaza. At least 68 people were arrested for carrying or chanting 'provocative' slogans.","crowd_size":"1000-10,000","longitude":13.4354,"latitude":52.481},{"event_date":"2023-11-02T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Neukolln","source":"Berliner Zeitung","categories":"National politics","description":"On 2 November 2023, at peak 150 people participated in a protest in front of the Ernst-Abbe High School in Berlin - Neukolln (Berlin) under the motto 'For freedom of speech and assembly'. The context of the demonstration is a conflict between a teacher and a student that escalated at the High School after the outbreak of the Israeli war.","crowd_size":"100-200","longitude":13.4354,"latitude":52.481},{"event_date":"2023-11-02T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"YNA","categories":"Human Rights","description":"On 2 November 2023, more than 10 residents demonstrated in front of the North Korean embassy in Berlin - Mitte (Berlin) to call for the release of political prisoners in North Korea, the dismantling of political prison camps, and the guarantee of human rights in North Korea. They were said to gather every Thursday evening.","crowd_size":"0-50","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-11-01T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Charlottenburg-Wilmersdorf","source":"Der Tagesspiegel","categories":"International politics","description":"On 1 November 2023, around 1,200 people participated in a pro-Palestine protest between Adenauerplatz and Henriettenplatz on Kurfurstendamm in Berlin - Charlottenburg-Wilmersdorf (Berlin) under the motto 'Demonstration in solidarity with Palestine'. During the protest isolated violations of the requirement to refrain from propagandistic or violence-glorifying statements and actions occurred, and one loudspeaker van was stopped by the police and excluded from the demonstration.","crowd_size":"1000-10,000","longitude":13.2639,"latitude":52.5079},{"event_date":"2023-11-01T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Tempelhof-Schoneberg","source":"Berliner Morgenpost","categories":"International politics","description":"On 1 November 2023, in total 1,800 people participated in a protest on Wittenbergplatz in Berlin - Tempelhof-Schoneberg (Berlin) under the motto 'Call for the release of the Israeli hostages kidnapped by Hamas on October 7'.","crowd_size":"1000-10,000","longitude":13.3738,"latitude":52.4406},{"event_date":"2023-10-31T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Berliner Morgenpost","categories":"National politics","description":"On 31 October 2023, around 50 people, members of the initiative '100% Tempelhofer Feld', demonstrated in front of the Rotes Rathaus in Berlin - Mitte against further construction on Tempelhofer Feld decided by the Senate.","crowd_size":"0-50","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-10-30T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Lichtenberg","source":"Markische Allgemeine","categories":"Environment","description":"On 30 October 2023, 3 members of Last Generation staged a protest by blocking traffic on three of the four lanes at the corner of Frankfurter Allee and Mollendorffstrasse in Berlin - Lichtenberg to call for climate protection.","crowd_size":"0-50","longitude":13.4951,"latitude":52.5197},{"event_date":"2023-10-30T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Charlottenburg-Wilmersdorf","source":"Markische Allgemeine","categories":"Environment","description":"On 30 October 2023, 5 members of Last Generation demonstrated and blocked traffic on the Kaiserdamm in the direction of Ernst-Reuter-Platz (Westend district) in Berlin - Charlottenburg-Wilmersdorf to call for climate protection.","crowd_size":"0-50","longitude":13.2639,"latitude":52.5079},{"event_date":"2023-10-29T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Mitteldeutschen Zeitung","categories":"International politics","description":"On 29 October 2023, around 250 people demonstrated on Rosa-Luxemburg-Platz in Berlin - Mitte against anti-Semitism, Islamism, and Hamas.","crowd_size":"200-500","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-10-29T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Charlottenburg-Wilmersdorf","source":"Mitteldeutschen Zeitung","categories":"National politics","description":"On 29 October 2023, at the call of the Thai Association and SPD, around 50 people demonstrated in Berlin - Charlottenburg-Wilmersdorf for the preservation of the Thai market in Preussenpark.","crowd_size":"0-50","longitude":13.2639,"latitude":52.5079},{"event_date":"2023-10-28T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Der Tagesspiegel","categories":"International politics","description":"On 28 October 2023, during the afternoon, around 280 people, including some carrying DKP flags, gathered spontaneously at Alexanderplatz in Berlin - Mitte for a pro-Palestine demonstration and to call for peace in the Middle East. They called for an end to what they claim to be a genocide. The police authorized the protest but limited it to 10 minutes. One placard also called for peace with Russia amid the Ukraine war.","crowd_size":"200-500","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-10-28T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Friedrichshain-Kreuzberg","source":"Der Tagesspiegel","categories":"International politics","description":"On 28 October 2023, around 11,000 (according to the police) people demonstrated from Oranienplatz to Puschkinallee in Berlin - Friedrichshain-Kreuzberg under the motto 'Global South United' to denounce Israelis attacks in the Gaza Strip. Around 5 people climbed onto the subway bridge between Gorlitzer Bahnhof and Schlesisches Tor and set off pyrotechnics. According to the director of the German Journalists' Union, a group of press photographers had been 'aggressively pushed away' by police officers at the beginning of the demonstration.","crowd_size":">10,000","longitude":13.4403,"latitude":52.501},{"event_date":"2023-10-28T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"Protest with intervention","district":"Mitte","source":"Markische Allgemeine","categories":"Environment","description":"On 28 October 2023, at the call of Last Generation, between up to 600 (according to the police) and more than 1,000 (according to organizers), people, including members of Extinction Rebellion, Scientist Rebellion and BUND, staged a protest at the 17. Juni Street at the Victory Column in Berlin - Mitte to call for an exit from fossil fuel, with some gluing themselves to the street and being physically removed by the police. Between 60 and 154 members of Last Generation later gathered to block the street, gluing themselves to the road. Police officers intervened physically to remove the demonstrators from the street.","crowd_size":"500-1000","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-10-27T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Der Tagesspiegel","categories":"International politics","description":"On 27 October 2023, at the call of Generation Palestine, around 50 people gathered, despite the ban, at Alexanderplatz in Berlin - Mitte for a pro-Palestine protest and to denounce the situation of Palestinian children in Gaza.","crowd_size":"0-50","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-10-27T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Charlottenburg-Wilmersdorf","source":"Markische Allgemeine","categories":"Environment","description":"On 27 October 2023, members of Last Generation staged a protest by blocking traffic around the A100 highway near Dreieck Charlottenburg and in the area of Kurfurstendamm and Joachimsthaler Street in Berlin - Charlottenburg-Wilmersdorf to call for climate protection.","crowd_size":"no report","longitude":13.2639,"latitude":52.5079},{"event_date":"2023-10-27T07:00:00.000Z","year":2023,"event_type":"Riots","mood":"Violent","district":"Mitte","source":"Der Tagesspiegel","categories":"International politics","description":"On 27 October 2023, during the night, around 100 people gathered spontaneously at the Brandenburg Gate in Berlin - Mitte for a pro-Palestine demonstration. When police officers tried to disperse the demonstration, and arrest demonstrators, scuffles broke out. Police officers used tear gas against a group of around 10 people who tried to intervene during an arrest around midnight. Around 70 people were arrested at Schadowstrasse. One officer was slightly injured to the arm.","crowd_size":"50-100","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-10-26T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"With intervention","district":"Charlottenburg-Wilmersdorf","source":"Berliner Zeitung","categories":"Environment","description":"On 26 October 2023, between 4 and 6 members of Last Generation blocked the road on Hohenzollerndamm, at the corner of Rudolstadter, in Berlin - Charlottenburg-Wilmersdorf to call for climate protection. Police forces intervened to clear the blockade.","crowd_size":"0-50","longitude":13.2639,"latitude":52.5079},{"event_date":"2023-10-25T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Berliner Zeitung","categories":"International politics","description":"On 25 October 2023, at the call of Vitsche (an association of young Ukrainians in Germany), around 150 people demonstrated in front of the Russian House of Science and Culture in Berlin - Mitte for the closure of the Russian House and in solidarity with Ukraine. They denounced the place as a place of Russian propaganda.","crowd_size":"100-200","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-10-24T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Charlottenburg-Wilmersdorf","source":"Berliner Morgenpost","categories":"Environment","description":"On 24 October 2023, 50 to 60 Last Generation activists protested in Berlin - Charlottenburg-Wilmersdorf (Berlin) and blocked Stadtautobahn A100 towards Wedding at the height of Goerdeler Steg for climate reasons. 27 activists glued themselves onto the road, 3 onto a rental car. Police prevented protesters from also blocking the left lane.","crowd_size":"50-100","longitude":13.2639,"latitude":52.5079},{"event_date":"2023-10-23T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"With intervention","district":"Mitte","source":"Sudwest Presse","categories":"Environment","description":"On 23 October 2023, about 40 Last Generation activists protested in 7 locations in Berlin (Berlin) and glued themselves onto the road to show their dissatisfaction with Chancellor Olaf Scholz (SPD) and for climate reasons. Three of these protests occurred on Stadtautobahn A100. The police dispersed the protest and removed the blockades.","crowd_size":"0-50","longitude":13.4105,"latitude":52.5244},{"event_date":"2023-10-22T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Mitteldeutschen Zeitung","categories":"International politics","description":"On 22 October 2023, 25,000 (according to the organizers) or 10,000 (according to police) people, including Israeli ambassador, political representatives such as the German President, SPD leader, CDU Secretary General, FDP Secretary General , The Greens Leader and The Left Leader, as well as Berlin's Governing Mayor (CDU), participated in a pro-Israel protest at Brandenburger Tor in Berlin - Mitte (Berlin), organized by a broad civil society alliance, including among others, all democratic parties of the Bundestag, DGB and 'Arbeitgeberverband' (Employer's Association), 'Zentralrat der Juden' (Central Council of Jews), the Evangelical and Catholic Churches and the Muslim organization Alhambra. The protesters showed their solidarity with Israel, called for better protection of Jewish life in Germany, and demanded an end of the violence against Jews.","crowd_size":">10,000","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-10-22T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"With intervention","district":"Mitte","source":"Der Tagesspiegel","categories":"International politics","description":"On 22 October 2023, in the evening, about 800 (according to police) or more than 1,000 (according to people on site) people, including Ahmad Tamim, a relevant representative of the 'Generation Islam' (an initiative that is part of the Islamist organization 'Hizb ut-Tahrir' which advocates the rule of a comprehensive caliphate based on the traditional Islamic legal principles of Sharia law) participated in a pro-Palestine protest on Alexanderplatz in Berlin - Mitte (Berlin) under the title 'Near-East-Conflict' to show solidarity with Palestine. In addition to 232 custodial interdictions, 175 administrative offenses and 25 criminal charges were filed for suspected rewarding and approval of criminal acts, suspected incitement to hatred and resistance to law enforcement officers. Two police officers were injured.","crowd_size":"500-1000","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-10-22T07:00:00.000Z","year":2023,"event_type":"Riots","mood":"Violent","district":"Mitte","source":"Der Tagesspiegel","categories":"International politics","description":"On 22 October 2023, in the afternoon, about 300 people joined a prohibited pro-Palestine demonstration at Potsdamer Platz in Berlin - Mitte under the title 'Peace in the Near East' which was then dispersed by the police who established the identity of numerous participants and charged a number of misdemeanors. During the dispersal, participants resisted and police officers were physically attacked which resulted in several criminal charges and the temporary arrest of about 100 people.","crowd_size":"200-500","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-10-22T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Mitteldeutschen Zeitung","categories":"International politics","description":"On 22 October 2023, people, including Israeli Ambassador Prosor, joined a commemorative event at Bebelplatz in Berlin - Mitte under the slogan 'Never again is now', during which candles were lit for the approximately 1,400 murdered Israelis and approximately 200 who were kidnapped by Hamas.","crowd_size":"no report","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-10-21T07:00:00.000Z","year":2023,"event_type":"Riots","mood":"Violent","district":"Neukolln","source":"Berliner Morgenpost","categories":"International politics","description":"On 21 October 2023, around 1,000 people, including many Arabs, but also members of other groups such as Jews and Israelis, participated in a march from Oranienplatz in Berlin - Friedrichshain-Kreuzberg to Hermannplatz in Berlin - Neukolln (Berlin) organized by the group 'Palastina Spricht' (Palestine speaks) under the motto 'Decolonize! Against oppression globally!' to call for a free Palestine. The demonstration was subject to a series of bans and during the march the police removed the loudspeaker van at the corner of Oranienstrasse and Adalbertstrasse, after statements in Arabic, which were violations of the assembly restrictions. At Kottbusser Damm, police officers stopped the procession again to inform the person in charge as well as the participants that anti-Israeli shouts would no longer be tolerated. The police arrested or established the identity of people in 11 cases. After the end of the demonstration, participants gathered in the area of Sonnenallee/Reuterstrasse, some also burned pyrotechnics and threw glass, also from a residential building. Pyrotechnics were fired at a police vehicle, but no damage was caused. The police arrested people or established their identity in 55 cases and one officer suffered injuries to his head and hand during the arrests.","crowd_size":"500-1000","longitude":13.4354,"latitude":52.481},{"event_date":"2023-10-20T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Mitteldeutschen Zeitung","categories":"Human Rights","description":"On 20 October 2023, about 1,000 people, including members of the Eritrean community, gathered at the call of the Central Council of Eritreans in Germany for an Eritrea-protest march starting at Potsdamer Platz and ending close to the Bundestag in Berlin - Mitte (Berlin). Protesters demand the preservation and respect of their fundamental rights and the protection of their cultural and social gatherings.","crowd_size":"500-1000","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-10-20T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Pankow","source":"Berliner Morgenpost","categories":"Environment","description":"On 20 October 2023, around 20 Last Generation activists protested on the corner of Prenzlauer Allee and Danziger Strasse in Berlin - Pankow (Berlin) for climate reasons by blocking the road, gluing themselves onto the road and with banners demanding a climate revolution.","crowd_size":"0-50","longitude":13.4031,"latitude":52.566},{"event_date":"2023-10-20T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"FridaysForFuture","categories":"Environment","description":"On 20 October 2023, Fridays for Future activists protested in Berlin - Mitte (Berlin) for the compliance with the climate protection law and more action against climate change by the federal government.","crowd_size":"no report","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-10-19T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"With intervention","district":"Charlottenburg-Wilmersdorf","source":"Berliner Zeitung","categories":"Environment","description":"On 19 October 2023, more than 12 Last Generation activists protested in Berlin - Charlottenburg-Wilmersdorf (Berlin) for climate reasons by blocking traffic on the city highway at the height of Charlottenburg Palace with three vehicles and sit-ins. The police dispersed the protest around mid-day. Earlier in the day, Last Generation activists also blocked the Wissel-Bridge in Berlin - Charlottenburg-Wilmersdorf.","crowd_size":"0-50","longitude":13.2639,"latitude":52.5079},{"event_date":"2023-10-19T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Tempelhof-Schoneberg","source":"Berliner Zeitung","categories":"Environment","description":"On 19 October 2023, Last Generation activists shortly blocked the city highway towards Neukolln at the height of Alboinstrasse in Berlin - Tempelhof-Schoneberg (Berlin) for climate reasons.","crowd_size":"no report","longitude":13.3738,"latitude":52.4406},{"event_date":"2023-10-18T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Berliner Morgenpost","categories":"Human Rights","description":"On 18 October 2023, between 50 and 60 people, including many people living in the neighborhood, organized a vigil in front of the synagogue in Berlin - Mitte (Berlin) which was attacked by unknown persons in the early morning, to show solidarity with the Jewish community and neighbors.","crowd_size":"50-100","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-10-18T07:00:00.000Z","year":2023,"event_type":"Riots","mood":"Violent","district":"Neukolln","source":"Merkur","categories":"International politics","description":"On 18 October 2023, about 1,000 people participated in a prohibited pro-Palestine demonstration on Sonnenallee in Berlin - Neukolln (Berlin) to show their solidarity with and demand freedom for Palestine. The demonstration led to hours of clashes between the demonstrators and police forces during which multiple cars and trucks were set on fire, stones and bottles were thrown at police officers, pyrotechnics were burned, and several police officers were injured. The police temporarily arrested about 174 people, many demonstrators did not comply with the officers' requests and resisted arrests, so the police used immediate coercion.","crowd_size":"500-1000","longitude":13.4354,"latitude":52.481},{"event_date":"2023-10-17T07:00:00.000Z","year":2023,"event_type":"Riots","mood":"Violent","district":"Mitte","source":"Berliner Zeitung","categories":"International politics","description":"On 17 October 2023, during the evening, around 700 people gathered at Pariser Platz in Berlin - Mitte for a spontaneous pro-Palestinian demonstration and to denounce the Israeli attack on a hospital in the Gaza Strip. Demonstrators threw bottles at police officers. One person tried to block the 17. Juni Street. One person was arrested for making anti-Israel statements.","crowd_size":"500-1000","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-10-17T07:00:00.000Z","year":2023,"event_type":"Riots","mood":"Violent","district":"Neukolln","source":"Berliner Zeitung","categories":"International politics","description":"On 17 October 2023, during the evening, up to 100 people gathered in the Sonnenallee and Pannierstrasse area in Berlin - Neukolln for a spontaneous pro-Palestinian demonstration. Pyrotechnics, fireworks, and firecrackers were set off several times by people who were partly masked. Clashes broke out and demonstrators threw stones, bottles, and firecrackers at police officers who responded with tear gas, batons, and a water cannon. Demonstrators brought several garbage containers onto the road at the corner of Sonnenallee and Reuterstrasse and set them on fire. 20 police officers were injured.","crowd_size":"50-100","longitude":13.4354,"latitude":52.481},{"event_date":"2023-10-16T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Berliner Morgenpost","categories":"Environment","description":"On 16 October 2023, around 9 members of Last Generation staged a protest on Alexanderplatz in Berlin - Mitte to call for climate protection. They threw paint on the World Time Clock and 2 people climbed on the clock with a banner that read: 'We are running out of time' to implement climate protection measures.","crowd_size":"0-50","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-10-15T07:00:00.000Z","year":2023,"event_type":"Riots","mood":"Violent","district":"Mitte","source":"Berliner Zeitung","categories":"International politics","description":"On 15 October 2023, around 1,000 people gathered on Potsdamer Platz in Berlin - Mitte for a pro-Palestine demonstration despite its ban. They denounced Israel's attacks on Palestine as genocide. Scuffles broke out when police officers dispersed the demonstration at the end of the event when around 350 people were still on site. Objects were thrown towards police officers who used tear gas. Around 155 people were arrested.","crowd_size":"500-1000","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-10-15T07:00:00.000Z","year":2023,"event_type":"Riots","mood":"Violent","district":"Neukolln","source":"Kieler Nachrichten","categories":"International politics","description":"On 15 October 2023, groups of 10 to 25 people demonstrated in Berlin - Neukolln for a free Palestine. Scuffles broke when police officers intervened to temporarily detain some people. Firecrackers were set off. Three people resisted, and bottles were occasionally thrown.","crowd_size":"0-50","longitude":13.4354,"latitude":52.481},{"event_date":"2023-10-14T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"With intervention","district":"Friedrichshain-Kreuzberg","source":"Berliner Zeitung","categories":"National politics","description":"On 14 October 2023, around 100 people demonstrated on Manteuffelstrasse in Berlin - Friedrichshain-Kreuzberg against the forced eviction of an apartment. Up to 10 people stood in front of the apartment's entrance and police officers pushed violently the protesters. 14 people were arrested.","crowd_size":"50-100","longitude":13.4403,"latitude":52.501},{"event_date":"2023-10-14T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Berliner Zeitung","categories":"Environment","description":"On 14 October 2023, Last Generation activists held a protest at Rosenthaler Platz in Berlin - Mitte to call for climate protection.","crowd_size":"no report","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-10-14T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Berliner Zeitung","categories":"International politics","description":"On 14 October 2023, around 50 people gathered in front of the Brandenburg Gate, on Pariser Platz, in Berlin - Mitte for a pro-Palestine demonstration. They called and chanted for freedom and solidarity for Gaza and Palestine. The event was registered under the title 'Peace in the Middle East - Two-State Solution'.","crowd_size":"50-100","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-10-13T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Friedrichshain-Kreuzberg","source":"Berliner Zeitung","categories":"International politics","description":"On 13 October 2023, during the evening, several hundred people, including a senator (SPD) and an MP (The Greens), demonstrated in front of the synagogue in Berlin - Friedrichshain-Kreuzberg to condemn the attack of the Hamas in Israel on 7 October 2023. They wanted to show solidarity with Israel and Berlin's Jews.","crowd_size":"100-200","longitude":13.4403,"latitude":52.501},{"event_date":"2023-10-13T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Friedrichshain-Kreuzberg","source":"Indymedia","categories":"National politics","description":"On 13 October 2023, about 80 people protested with speeches and loud chants in front of Manteuffelstrasse 63 in Berlin - Friedrichshain-Kreuzberg (Berlin) against the forced eviction of a person, who had been living in the house for 40 years, and against profit-oriented housing policies.","crowd_size":"50-100","longitude":13.4403,"latitude":52.501},{"event_date":"2023-10-13T07:00:00.000Z","year":2023,"event_type":"Riots","mood":"Violent","district":"Neukolln","source":"Mitteldeutschen Zeitung","categories":"International politics","description":"On 13 October 2023, up to 150 people gathered several times at the intersection of Sonnenallee and Reuterstrasse in Berlin - Neukolln for a pro-Palestine demonstration despite its ban. 24 people were temporarily taken into custody. There were criminal charges for breach of the peace, physical assault, resistance to law enforcement officers, disturbing the public peace, and other offenses.","crowd_size":"100-200","longitude":13.4354,"latitude":52.481},{"event_date":"2023-10-12T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Berliner Zeitung","categories":"International politics","description":"On 12 October 2023, around 60 people gathered on Pankstrasse in Wedding and also at Potsdamer Platz, near the Federal Foreign Office, in Berlin - Mitte for a pro-Palestinian protest in solidarity with the civilian population in the Gaza Strip, despite the ban against it. Demonstrators were against neo-colonialism and therefore the Israeli government.","crowd_size":"50-100","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-10-11T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"With intervention","district":"Neukolln","source":"BNN","categories":"International politics","description":"On 11 October 2023, hundreds of people gathered in the Hermannplatz and Sonnenallee area in Berlin - Neukolln for a pro-Palestine demonstration despite a ban on the event. Police officers intervened and scuffles broke out. There was no further information.","crowd_size":"50-100","longitude":13.4354,"latitude":52.481},{"event_date":"2023-10-10T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Friedrichshain-Kreuzberg","source":"Markische Allgemeine","categories":"Environment","description":"On 10 October 2023, Last Generation activists protested at Kottbusser Tor in Berlin - Friedrichshain-Kreuzberg (Berlin) for climate reasons by blocking the road and gluing themselves onto it. Shortly after the start of the demonstration, the police ended the blockade. No further information about how the police intervened are available.","crowd_size":"no report","longitude":13.4403,"latitude":52.501},{"event_date":"2023-10-10T07:00:00.000Z","year":2023,"event_type":"Riots","mood":"Violent","district":"Friedrichshain-Kreuzberg","source":"Berliner Morgenpost","categories":"Housing","description":"On 10 October 2023, about 40 hooded persons, belonging to the far left-scene, deposited metal nails on the roadway of Rigaer Strasse in Berlin - Friedrichshain-Kreuzberg (Berlin) and set fire to a trash can, tires, garbage, and shopping carts. Police forces were pelted with pyrotechnics and stones on arrival, injuring ten officers and causing respiratory irritation, blast trauma and bruising. Later, a vacant apartment in a formerly occupied house in Liebigstrasse was opened by force and banners with the inscription 'Expropriate' were hung up. Here, too, the police were pelted with pyrotechnics by so far unknown suspects, but were not hit. Further investigations are being conducted by the Police State Protection Service of the State Criminal Police Office.","crowd_size":"0-50","longitude":13.4403,"latitude":52.501},{"event_date":"2023-10-09T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Neukolln","source":"Markische Allgemeine","categories":"Environment","description":"On 9 October 2023, Last Generation activists protested on Britzer Damm in Berlin - Neukolln (Berlin) by blocking the road for climate reasons.","crowd_size":"no report","longitude":13.4354,"latitude":52.481},{"event_date":"2023-10-09T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Pankow","source":"Markische Allgemeine","categories":"Environment","description":"On 9 October 2023, Last Generation activists protested on Danziger Strasse in Berlin - Pankow (Berlin) by blocking the road for climate reasons.","crowd_size":"no report","longitude":13.4031,"latitude":52.566},{"event_date":"2023-10-09T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Tempelhof-Schoneberg","source":"Markische Allgemeine","categories":"Environment","description":"On 9 October 2023, Last Generation activists protested on Tempelhofer Damm around Paradestrasse in Berlin - Tempelhof-Schoneberg (Berlin) by blocking the road for climate reasons.","crowd_size":"no report","longitude":13.3738,"latitude":52.4406},{"event_date":"2023-10-09T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Tagesschau","categories":"National politics","description":"On 9 October 2023, 30,000 mail carriers responded to a call by Ver.di and demonstrated at the Brandenburg Gate in Berlin - Mitte (Berlin) against planned changes to the Postal Act seeing less frequent delivery and more competition. The protesters are concerned about tens of thousands of jobs and the working conditions of delivery staff and are demanded that letters continue to be delivered every day.","crowd_size":">10,000","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-10-09T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Presseportal","categories":"Economy","description":"On 9 October 2023, members of the 'Initiative Neue Soziale Marktwirtschaft (INSM)' (New Social Market Economy Initiative) protested in Berlin - Mitte (Berlin) in front of the party headquarters of CDU, FDP, Greens and SPD to criticize the focus of the parties and demand a change towards a better economic policy. The New Social Market Economy Initiative is a non-partisan alliance of politicians, business leaders and academics that promotes the principles of the social market economy in Germany and provides impetus for modern free-market policies.","crowd_size":"no report","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-10-09T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Die Tageszeitung","categories":"Human Rights","description":"On 9 October 2023, Ezids from Iraq started a multi-day protest in front of the Bundestag in Berlin - Mitte (Berlin) against the threat of deportation. Many of them went on hunger strike.","crowd_size":"no report","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-10-08T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Berliner Zeitung","categories":"International politics","description":"On 8 October 2023, around 2,000 people, including representatives of the CDU, SPD, the Greens, the association Christen an der Seite Israels e.V. (Christians on Israel's Side e.V.) as well as Israeli ambassador Ron Prosor, joined a protest in front of Brandenburger Tor in Berlin - Mitte (Berlin) organized by 'Junges Forum der Deutsch-Israelischen Gesellschaft' (Young Forum of the German-Israeli society), Judische Studierendenunion (Jewish Student Union) and the Jewish association 'Werteinitiative' (Value-initiative) in solidarity with Israel. Some of the speakers and demonstrators emphasized Israel's sovereignty and right to self-defense and demanded sanctions against Iran.","crowd_size":"1000-10,000","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-10-07T07:00:00.000Z","year":2023,"event_type":"Riots","mood":"Violent","district":"Neukolln","source":"Der Tagesspiegel","categories":"International politics","description":"On 7 October 2023, around 40 people, including members of the network Samidoun, participated in a pro-Palestine demonstration on Sonnenallee in Berlin - Neukolln (Berlin). The police prohibited the registration of a gathering later on and broke up the demonstration due to continuous violations against the peacefulness requirements of the assembly law, 'anti-Israel and violence-glorifying chants' and mummery. The demonstrators had chanted 'Yallah Intifada', 'Free Palestine' and 'From the river to the sea', which are usually banned by the police at demonstrations because it questions Israel's right to exist, despite the police asking the event's leader to influence the participants to refrain from anti-Israel slogans. Since the leader did not comply, the police intervened to dissolve the demonstration, took the personal data of the demonstrators, filed 6 charges for resistance, assaulting officers and breach of peace as well as provisionally arrested several people who did not want to leave despite the dispersal of the gathering. Two police officers were injured.","crowd_size":"0-50","longitude":13.4354,"latitude":52.481},{"event_date":"2023-10-06T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"With intervention","district":"Mitte","source":"Berliner Morgenpost","categories":"Environment","description":"On 6 October 2023, several dozen Last Generation activists protested on Potsdamer Platz in Berlin - Mitte (Berlin) for climate reasons. They blocked parts of the intersection and 9 activists glued themselves onto the road. The police intervened, led, dragged, and carried away the activists and gradually dislodged the glued ones from the street.","crowd_size":"0-50","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-10-05T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Charlottenburg-Wilmersdorf","source":"Markische Allgemeine","categories":"Environment","description":"On 5 October 2023, Last Generation activists protested on Ku'damm and Bundesallee in Berlin - Charlottenburg-Wilmersdorf (Berlin) for climate concerns and to raise awareness for the connection between the climate and food crises by blocking the road with hay and straw bales. Some of the protesters glued themselves onto the road.","crowd_size":"no report","longitude":13.2639,"latitude":52.5079},{"event_date":"2023-10-05T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Markische Allgemeine","categories":"Environment","description":"On 5 October 2023, around 18 Last Generation activists protested in front of the Brandenburger Gate in Berlin - Mitte (Berlin) for climate concerns and to raise awareness for the connection between the climate and food crises by blocking the road with hay and straw bales. Some of the protesters glued themselves onto the road.","crowd_size":"0-50","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-10-03T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"With intervention","district":"Charlottenburg-Wilmersdorf","source":"General Anzeiger","categories":"Environment","description":"On 3 October 2023, climate activists blocked access roads to the Olympiastadion on the Rudolf-Wissell Bridge and glued themselves to the road in Berlin - Charlottenburg-Wilmersdorf to call for climate protection. Police officers tried physically to detach the people from the road. They gathered on the occasion of a Champion's League game (Union Berlin-Sporting Braga).","crowd_size":"no report","longitude":13.2639,"latitude":52.5079},{"event_date":"2023-10-02T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Der Tagesspiegel","categories":"National politics","description":"On 2 October 2023, at the call of Virchowbund, an association of practicing doctors, health workers, including members of Kassenarztlichen Vereinigung (Association of Statutory Health Insurance Physicians (KV)), demonstrated in front of the building of the Federal Ministry of Health in Berlin - Mitte under the motto 'Doctors in Need' to denounce poor working conditions due to the government's austerity policy and health insurances. Protesters denounced that many practices are in distress due to inflation, high energy prices, and a shortage of skilled workers. Doctors symbolically threw their scrubs in front of the building.","crowd_size":"no report","longitude":13.4024,"latitude":52.5177},{"event_date":"2023-10-02T07:00:00.000Z","year":2023,"event_type":"Protests","mood":"Peaceful","district":"Mitte","source":"Hessische Niedersachsische Allgemeine","categories":"Environment","description":"On 2 October 2023, members of Last Generation staged a protest by blocking traffic and gluing themselves to the road in Berlin to call for climate protection. Passers-by spat on the activists and pelted them with eggs.","crowd_size":"no report","longitude":13.4105,"latitude":52.5244}]